# GetStructuralSectionShapeName Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
LabelUtils..::..GetStructuralSectionShapeName Method
LabelUtils Class See Also
---
Gets the user-visible name for a StructuralSectionShape.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public static string GetStructuralSectionShapeName(
	StructuralSectionShape shape
)
```

Visual Basic
---
```text
Public Shared Function GetStructuralSectionShapeName ( _
	shape As StructuralSectionShape _
) As String
```

Visual C++
---
```text
public:
static String^ GetStructuralSectionShapeName(
	StructuralSectionShape shape
)
```

# ### Parameters
shape
    Type: Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionShape The StructuralSectionShape to get the user-visible name.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | A value passed for an enumeration argument is not a member of that enumeration |

# See Also
LabelUtils Class
Autodesk.Revit.DB Namespace